//
// Created by edy on 2022/6/30.
//

/*
 * C++简介
 * C++是一种静态类型、编译式的、通用的、大小写敏感的、不规则的编程语言，支持过程化编程，面相对象编程和泛型编程。
 * C++被认为是一种中级语言，它综合了高级语音和低级语言的特点。
 * C++是B S 于1979年再新泽西州美利山贝尔实验室开发设计完成的。C++进一步扩充和完善了C语言，最初命名为带类的C，1983更名为C++。
 * C++是C的一个超集，事实上，任何合法的C程序都是合法的C++程序。
 * 注意：使用静态类型的编程语言是再编译时执行类型检查，而不是在运行时执行类型检查。
 *
 *
 * 面相对象程序设计
 * C++完全支持面向对象的程序设计，包括面向对象开发的四大特性：
 * 封装
 * 继承
 * 多态
 * 抽象
 *
 *
 * 标准库
 * 标准的C++由三个重要部分组成：
 * 核心语言，提供了所有构建块、包括变量、数据类型和常量等等。
 * C++标准库，提供了大量的函数，用于操作文件、字符串等。
 * 标准模板库(STL),提供了大量的方法，用于操作数据结构等。
 *
 *
 * ANSI标准
 * ANSI标准是为了确保C++的便携性----您所编写的代码再Mac、Unix、Windows、Alpha计算机上都能通过编译。由于ANSI标准已经
 * 稳定使用了很长时间，所以主要的C++编译器的制造商都支持ANSI标准。
 *
 *
 * C++的使用
 * C++通常用于编写设备驱动程序和其他要求实时性的直接操作硬件的软件。
 * C++广泛应用于教学和研究。
 *
 * 标准化（部分）
 * 2017     C++17       第五个C++标准
 * 2014     C++14       第四个C++标准
 * 2011     C++11       第三个C++标准
 * 2003     C++03       第二个C++标准
 * 1998     C++98       第一个C++标准
 *
 */
#include "Lesson_1_简介.h"

int main1(){
    printf("just can one main func");
    printf("include iostream can use printf");
    return 0;
}


